In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# 타이타닉 데이터 불러오기
df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')
df.head()

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000
4         0       3  ...                       0   8.0500

[5 rows x 8 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [ ]:
ages = df["Age"]
ages.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [ ]:
df["Age"].shape

(887,)

In [8]:
age_sex = df[["Age", "Sex"]]

In [9]:
age_sex.head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [10]:
above_35 = df[df["Age"]>35]

In [11]:
above_35.head()

    Survived  Pclass  ... Parents/Children Aboard     Fare
1          1       1  ...                       0  71.2833
6          0       1  ...                       0  51.8625
11         1       1  ...                       0  26.5500
13         0       3  ...                       5  31.2750
15         1       2  ...                       0  16.0000

[5 rows x 8 columns]

In [12]:
adult_names = df.loc[df["Age"]>35, "Name"]
adult_names.head()

1     Mrs. John Bradley (Florence Briggs Thayer) Cum...
6                                Mr. Timothy J McCarthy
11                              Miss. Elizabeth Bonnell
13                           Mr. Anders Johan Andersson
15                       Mrs. (Mary D Kingcome) Hewlett
Name: Name, dtype: object